# 프레임 정보를 찾는데 이용한 사이트: http://www.spritecow.com/

# 애니메이션들의 시작위치는 대부분 0이나 0이 아닌 애니메이션 존재
# dictionary = { animation_name: tuple(frame_start_x, frame_start_y, frame_height, farme_count)

micky_animation = {
    "Lose": (0, 78, [29, 32, 25, 32, 26], 28, 5),
    "Win": (0, 111, [26, 35, 33, 39], 28, 4),
    "Taunt_back": (0, 144, [18, 24, 18, 31, 26, 28], 38, 6),
    "Taunt_front": (161, 144, [18, 24, 18, 31, 26, 28], 38, 6),
    "Diving_left_back": (0, 252, [24, 55, 44, 38, 25], 24, 5),
    "Diving_left_front": (223, 252, [25, 54, 48, 37, 30], 24, 5),
    "Diving_right_back": (0, 283, [33, 57, 46, 38, 31], 31, 5),
    "Diving_right_front": (223, 283, [36, 57, 46, 39, 32], 31, 5),
    "Hit_left_back": (0, 318, [23, 39, 20, 28, 20], 34, 5),
    "Hit_left_front": (223, 318, [23, 39, 20, 28, 20], 34, 5),
    "Hit_right_back": (0, 359, [28, 42, 19, 34, 23], 33, 5),
    "Hit_right_front": (223, 359, [27, 42, 19, 36, 24], 33, 5),
    "Run_back": (0, 642, [25, 27, 21, 28, 21, 27], 32, 6),
    "Run_right_back": (0, 606, [33, 38, 22, 29, 23, 34], 31, 6),
    "Run_right": (0, 571, [29, 39, 30, 39, 33, 35], 30, 6),
    "Run_right_front": (0, 537, [20, 27, 28, 39, 30, 26], 29, 6),
    "Run_front": (0, 502, [26, 28, 21, 28, 21, 27], 30, 6),
    "Run_left_front": (0, 468, [33, 38, 23, 29, 24, 34], 29, 6),
    "Run_left": (0, 433, [29, 38, 31, 39, 35, 34], 30, 6),
    "Run_left_back": (0, 397, [20, 26, 27, 38, 31, 25], 31, 6),
    "Idle_back": (0, 681, [20, 25, 18, 25, 19], 28, 5),
    "Idle_front": (157, 681, [20, 25, 18, 25, 19], 28, 5),
    "High_hit_back": (0, 714, [25, 26, 24, 39, 25], 46, 5),
    "High_hit_front": (157, 714, [23, 26, 25, 38, 25], 46, 5),
    "Preparing_serve_back": (0, 765, [27, 38, 18, 31], 35, 4),
    "Preparing_serve_front": (157, 765, [27, 37, 17, 29], 35, 4),
}
